name: "Places2-365-CNN"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    crop_size: 224
    mean_value: 105.448
    mean_value: 113.768
    mean_value: 116.052
  }
  image_data_param {
    source: ""
    batch_size: 20
    new_height: 256
    new_width: 256
    root_folder: ""
  }
}
layer {
  name: "conv1_1_3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1_3x3_s2"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv1_1_3x3_s2/bn"
  type: "BatchNorm"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_1_3x3_s2"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_1_3x3_s2/scale"
  type: "Scale"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_1_3x3_s2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_1_3x3_s2/relu"
  type: "ReLU"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_1_3x3_s2"
}
layer {
  name: "conv1_2_3x3"
  type: "Convolution"
  bottom: "conv1_1_3x3_s2"
  top: "conv1_2_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv1_2_3x3/bn"
  type: "BatchNorm"
  bottom: "conv1_2_3x3"
  top: "conv1_2_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_2_3x3/scale"
  type: "Scale"
  bottom: "conv1_2_3x3"
  top: "conv1_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_2_3x3/relu"
  type: "ReLU"
  bottom: "conv1_2_3x3"
  top: "conv1_2_3x3"
}
layer {
  name: "conv1_3_3x3"
  type: "Convolution"
  bottom: "conv1_2_3x3"
  top: "conv1_3_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv1_3_3x3/bn"
  type: "BatchNorm"
  bottom: "conv1_3_3x3"
  top: "conv1_3_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv1_3_3x3/scale"
  type: "Scale"
  bottom: "conv1_3_3x3"
  top: "conv1_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_3_3x3/relu"
  type: "ReLU"
  bottom: "conv1_3_3x3"
  top: "conv1_3_3x3"
}
layer {
  name: "pool1_3x3_s2"
  type: "Pooling"
  bottom: "conv1_3_3x3"
  top: "pool1_3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2_1_1x1_reduce"
  type: "Convolution"
  bottom: "pool1_3x3_s2"
  top: "conv2_1_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_1_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_1_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_1_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_1x1_reduce"
}
layer {
  name: "conv2_1_3x3"
  type: "Convolution"
  bottom: "conv2_1_1x1_reduce"
  top: "conv2_1_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_1_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_1_3x3"
  top: "conv2_1_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_1_3x3/scale"
  type: "Scale"
  bottom: "conv2_1_3x3"
  top: "conv2_1_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_1_3x3/relu"
  type: "ReLU"
  bottom: "conv2_1_3x3"
  top: "conv2_1_3x3"
}
layer {
  name: "conv2_1_1x1_increase"
  type: "Convolution"
  bottom: "conv2_1_3x3"
  top: "conv2_1_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_1_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_1_1x1_increase"
  top: "conv2_1_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_1_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_1_1x1_increase"
  top: "conv2_1_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_1_1x1_proj"
  type: "Convolution"
  bottom: "pool1_3x3_s2"
  top: "conv2_1_1x1_proj"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_1_1x1_proj/bn"
  type: "BatchNorm"
  bottom: "conv2_1_1x1_proj"
  top: "conv2_1_1x1_proj"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_1_1x1_proj/scale"
  type: "Scale"
  bottom: "conv2_1_1x1_proj"
  top: "conv2_1_1x1_proj"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_1"
  type: "Eltwise"
  bottom: "conv2_1_1x1_proj"
  bottom: "conv2_1_1x1_increase"
  top: "conv2_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_1/relu"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_2_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_2_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_2_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_1x1_reduce"
}
layer {
  name: "conv2_2_3x3"
  type: "Convolution"
  bottom: "conv2_2_1x1_reduce"
  top: "conv2_2_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_2_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_2_3x3"
  top: "conv2_2_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_2_3x3/scale"
  type: "Scale"
  bottom: "conv2_2_3x3"
  top: "conv2_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_2_3x3/relu"
  type: "ReLU"
  bottom: "conv2_2_3x3"
  top: "conv2_2_3x3"
}
layer {
  name: "conv2_2_1x1_increase"
  type: "Convolution"
  bottom: "conv2_2_3x3"
  top: "conv2_2_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_2_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_2_1x1_increase"
  top: "conv2_2_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_2_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_2_1x1_increase"
  top: "conv2_2_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_2"
  type: "Eltwise"
  bottom: "conv2_1"
  bottom: "conv2_2_1x1_increase"
  top: "conv2_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_2/relu"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "conv2_3_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_2"
  top: "conv2_3_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_3_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_3_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_3_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_1x1_reduce"
}
layer {
  name: "conv2_3_3x3"
  type: "Convolution"
  bottom: "conv2_3_1x1_reduce"
  top: "conv2_3_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_3_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_3_3x3"
  top: "conv2_3_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_3_3x3/scale"
  type: "Scale"
  bottom: "conv2_3_3x3"
  top: "conv2_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_3_3x3/relu"
  type: "ReLU"
  bottom: "conv2_3_3x3"
  top: "conv2_3_3x3"
}
layer {
  name: "conv2_3_1x1_increase"
  type: "Convolution"
  bottom: "conv2_3_3x3"
  top: "conv2_3_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_3_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_3_1x1_increase"
  top: "conv2_3_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_3_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_3_1x1_increase"
  top: "conv2_3_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_3"
  type: "Eltwise"
  bottom: "conv2_2"
  bottom: "conv2_3_1x1_increase"
  top: "conv2_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_3/relu"
  type: "ReLU"
  bottom: "conv2_3"
  top: "conv2_3"
}
layer {
  name: "conv2_4_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_3"
  top: "conv2_4_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_4_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_4_1x1_reduce"
  top: "conv2_4_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_4_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_4_1x1_reduce"
  top: "conv2_4_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_4_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_4_1x1_reduce"
  top: "conv2_4_1x1_reduce"
}
layer {
  name: "conv2_4_3x3"
  type: "Convolution"
  bottom: "conv2_4_1x1_reduce"
  top: "conv2_4_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_4_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_4_3x3"
  top: "conv2_4_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_4_3x3/scale"
  type: "Scale"
  bottom: "conv2_4_3x3"
  top: "conv2_4_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_4_3x3/relu"
  type: "ReLU"
  bottom: "conv2_4_3x3"
  top: "conv2_4_3x3"
}
layer {
  name: "conv2_4_1x1_increase"
  type: "Convolution"
  bottom: "conv2_4_3x3"
  top: "conv2_4_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_4_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_4_1x1_increase"
  top: "conv2_4_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_4_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_4_1x1_increase"
  top: "conv2_4_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_4"
  type: "Eltwise"
  bottom: "conv2_3"
  bottom: "conv2_4_1x1_increase"
  top: "conv2_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_4/relu"
  type: "ReLU"
  bottom: "conv2_4"
  top: "conv2_4"
}
layer {
  name: "conv2_5_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_4"
  top: "conv2_5_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_5_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_5_1x1_reduce"
  top: "conv2_5_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_5_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_5_1x1_reduce"
  top: "conv2_5_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_5_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_5_1x1_reduce"
  top: "conv2_5_1x1_reduce"
}
layer {
  name: "conv2_5_3x3"
  type: "Convolution"
  bottom: "conv2_5_1x1_reduce"
  top: "conv2_5_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_5_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_5_3x3"
  top: "conv2_5_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_5_3x3/scale"
  type: "Scale"
  bottom: "conv2_5_3x3"
  top: "conv2_5_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_5_3x3/relu"
  type: "ReLU"
  bottom: "conv2_5_3x3"
  top: "conv2_5_3x3"
}
layer {
  name: "conv2_5_1x1_increase"
  type: "Convolution"
  bottom: "conv2_5_3x3"
  top: "conv2_5_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_5_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_5_1x1_increase"
  top: "conv2_5_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_5_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_5_1x1_increase"
  top: "conv2_5_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_5"
  type: "Eltwise"
  bottom: "conv2_4"
  bottom: "conv2_5_1x1_increase"
  top: "conv2_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_5/relu"
  type: "ReLU"
  bottom: "conv2_5"
  top: "conv2_5"
}
layer {
  name: "conv2_6_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_5"
  top: "conv2_6_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_6_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_6_1x1_reduce"
  top: "conv2_6_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_6_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_6_1x1_reduce"
  top: "conv2_6_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_6_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_6_1x1_reduce"
  top: "conv2_6_1x1_reduce"
}
layer {
  name: "conv2_6_3x3"
  type: "Convolution"
  bottom: "conv2_6_1x1_reduce"
  top: "conv2_6_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_6_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_6_3x3"
  top: "conv2_6_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_6_3x3/scale"
  type: "Scale"
  bottom: "conv2_6_3x3"
  top: "conv2_6_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_6_3x3/relu"
  type: "ReLU"
  bottom: "conv2_6_3x3"
  top: "conv2_6_3x3"
}
layer {
  name: "conv2_6_1x1_increase"
  type: "Convolution"
  bottom: "conv2_6_3x3"
  top: "conv2_6_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_6_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_6_1x1_increase"
  top: "conv2_6_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_6_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_6_1x1_increase"
  top: "conv2_6_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_6"
  type: "Eltwise"
  bottom: "conv2_5"
  bottom: "conv2_6_1x1_increase"
  top: "conv2_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_6/relu"
  type: "ReLU"
  bottom: "conv2_6"
  top: "conv2_6"
}
layer {
  name: "conv2_7_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_6"
  top: "conv2_7_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_7_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_7_1x1_reduce"
  top: "conv2_7_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_7_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_7_1x1_reduce"
  top: "conv2_7_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_7_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_7_1x1_reduce"
  top: "conv2_7_1x1_reduce"
}
layer {
  name: "conv2_7_3x3"
  type: "Convolution"
  bottom: "conv2_7_1x1_reduce"
  top: "conv2_7_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_7_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_7_3x3"
  top: "conv2_7_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_7_3x3/scale"
  type: "Scale"
  bottom: "conv2_7_3x3"
  top: "conv2_7_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_7_3x3/relu"
  type: "ReLU"
  bottom: "conv2_7_3x3"
  top: "conv2_7_3x3"
}
layer {
  name: "conv2_7_1x1_increase"
  type: "Convolution"
  bottom: "conv2_7_3x3"
  top: "conv2_7_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_7_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_7_1x1_increase"
  top: "conv2_7_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_7_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_7_1x1_increase"
  top: "conv2_7_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_7"
  type: "Eltwise"
  bottom: "conv2_6"
  bottom: "conv2_7_1x1_increase"
  top: "conv2_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_7/relu"
  type: "ReLU"
  bottom: "conv2_7"
  top: "conv2_7"
}
layer {
  name: "conv2_8_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_7"
  top: "conv2_8_1x1_reduce"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_8_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv2_8_1x1_reduce"
  top: "conv2_8_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_8_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv2_8_1x1_reduce"
  top: "conv2_8_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_8_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv2_8_1x1_reduce"
  top: "conv2_8_1x1_reduce"
}
layer {
  name: "conv2_8_3x3"
  type: "Convolution"
  bottom: "conv2_8_1x1_reduce"
  top: "conv2_8_3x3"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv2_8_3x3/bn"
  type: "BatchNorm"
  bottom: "conv2_8_3x3"
  top: "conv2_8_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_8_3x3/scale"
  type: "Scale"
  bottom: "conv2_8_3x3"
  top: "conv2_8_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_8_3x3/relu"
  type: "ReLU"
  bottom: "conv2_8_3x3"
  top: "conv2_8_3x3"
}
layer {
  name: "conv2_8_1x1_increase"
  type: "Convolution"
  bottom: "conv2_8_3x3"
  top: "conv2_8_1x1_increase"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv2_8_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv2_8_1x1_increase"
  top: "conv2_8_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv2_8_1x1_increase/scale"
  type: "Scale"
  bottom: "conv2_8_1x1_increase"
  top: "conv2_8_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_8"
  type: "Eltwise"
  bottom: "conv2_7"
  bottom: "conv2_8_1x1_increase"
  top: "conv2_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv2_8/relu"
  type: "ReLU"
  bottom: "conv2_8"
  top: "conv2_8"
}
layer {
  name: "conv3_1_1x1_reduce"
  type: "Convolution"
  bottom: "conv2_8"
  top: "conv3_1_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_1_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_1_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_1_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_1x1_reduce"
}
layer {
  name: "conv3_1_3x3"
  type: "Convolution"
  bottom: "conv3_1_1x1_reduce"
  top: "conv3_1_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_1_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_1_3x3"
  top: "conv3_1_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_1_3x3/scale"
  type: "Scale"
  bottom: "conv3_1_3x3"
  top: "conv3_1_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_1_3x3/relu"
  type: "ReLU"
  bottom: "conv3_1_3x3"
  top: "conv3_1_3x3"
}
layer {
  name: "conv3_1_1x1_increase"
  type: "Convolution"
  bottom: "conv3_1_3x3"
  top: "conv3_1_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_1_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_1_1x1_increase"
  top: "conv3_1_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_1_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_1_1x1_increase"
  top: "conv3_1_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_1_1x1_proj"
  type: "Convolution"
  bottom: "conv2_8"
  top: "conv3_1_1x1_proj"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "conv3_1_1x1_proj/bn"
  type: "BatchNorm"
  bottom: "conv3_1_1x1_proj"
  top: "conv3_1_1x1_proj"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_1_1x1_proj/scale"
  type: "Scale"
  bottom: "conv3_1_1x1_proj"
  top: "conv3_1_1x1_proj"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_1"
  type: "Eltwise"
  bottom: "conv3_1_1x1_proj"
  bottom: "conv3_1_1x1_increase"
  top: "conv3_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_1/relu"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_2_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_2_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_2_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_1x1_reduce"
}
layer {
  name: "conv3_2_3x3"
  type: "Convolution"
  bottom: "conv3_2_1x1_reduce"
  top: "conv3_2_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_2_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_2_3x3"
  top: "conv3_2_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_2_3x3/scale"
  type: "Scale"
  bottom: "conv3_2_3x3"
  top: "conv3_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_2_3x3/relu"
  type: "ReLU"
  bottom: "conv3_2_3x3"
  top: "conv3_2_3x3"
}
layer {
  name: "conv3_2_1x1_increase"
  type: "Convolution"
  bottom: "conv3_2_3x3"
  top: "conv3_2_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_2_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_2_1x1_increase"
  top: "conv3_2_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_2_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_2_1x1_increase"
  top: "conv3_2_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_2"
  type: "Eltwise"
  bottom: "conv3_1"
  bottom: "conv3_2_1x1_increase"
  top: "conv3_2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_2/relu"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_3_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_3_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_3_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_1x1_reduce"
}
layer {
  name: "conv3_3_3x3"
  type: "Convolution"
  bottom: "conv3_3_1x1_reduce"
  top: "conv3_3_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_3_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_3_3x3"
  top: "conv3_3_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_3_3x3/scale"
  type: "Scale"
  bottom: "conv3_3_3x3"
  top: "conv3_3_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_3_3x3/relu"
  type: "ReLU"
  bottom: "conv3_3_3x3"
  top: "conv3_3_3x3"
}
layer {
  name: "conv3_3_1x1_increase"
  type: "Convolution"
  bottom: "conv3_3_3x3"
  top: "conv3_3_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_3_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_3_1x1_increase"
  top: "conv3_3_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_3_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_3_1x1_increase"
  top: "conv3_3_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_3"
  type: "Eltwise"
  bottom: "conv3_2"
  bottom: "conv3_3_1x1_increase"
  top: "conv3_3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_3/relu"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "conv3_4_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_3"
  top: "conv3_4_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_4_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_4_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_4_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_1x1_reduce"
}
layer {
  name: "conv3_4_3x3"
  type: "Convolution"
  bottom: "conv3_4_1x1_reduce"
  top: "conv3_4_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_4_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_4_3x3"
  top: "conv3_4_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_4_3x3/scale"
  type: "Scale"
  bottom: "conv3_4_3x3"
  top: "conv3_4_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_4_3x3/relu"
  type: "ReLU"
  bottom: "conv3_4_3x3"
  top: "conv3_4_3x3"
}
layer {
  name: "conv3_4_1x1_increase"
  type: "Convolution"
  bottom: "conv3_4_3x3"
  top: "conv3_4_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_4_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_4_1x1_increase"
  top: "conv3_4_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_4_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_4_1x1_increase"
  top: "conv3_4_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_4"
  type: "Eltwise"
  bottom: "conv3_3"
  bottom: "conv3_4_1x1_increase"
  top: "conv3_4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_4/relu"
  type: "ReLU"
  bottom: "conv3_4"
  top: "conv3_4"
}
layer {
  name: "conv3_5_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_4"
  top: "conv3_5_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_5_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_5_1x1_reduce"
  top: "conv3_5_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_5_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_5_1x1_reduce"
  top: "conv3_5_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_5_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_5_1x1_reduce"
  top: "conv3_5_1x1_reduce"
}
layer {
  name: "conv3_5_3x3"
  type: "Convolution"
  bottom: "conv3_5_1x1_reduce"
  top: "conv3_5_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_5_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_5_3x3"
  top: "conv3_5_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_5_3x3/scale"
  type: "Scale"
  bottom: "conv3_5_3x3"
  top: "conv3_5_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_5_3x3/relu"
  type: "ReLU"
  bottom: "conv3_5_3x3"
  top: "conv3_5_3x3"
}
layer {
  name: "conv3_5_1x1_increase"
  type: "Convolution"
  bottom: "conv3_5_3x3"
  top: "conv3_5_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_5_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_5_1x1_increase"
  top: "conv3_5_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_5_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_5_1x1_increase"
  top: "conv3_5_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_5"
  type: "Eltwise"
  bottom: "conv3_4"
  bottom: "conv3_5_1x1_increase"
  top: "conv3_5"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_5/relu"
  type: "ReLU"
  bottom: "conv3_5"
  top: "conv3_5"
}
layer {
  name: "conv3_6_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_5"
  top: "conv3_6_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_6_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_6_1x1_reduce"
  top: "conv3_6_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_6_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_6_1x1_reduce"
  top: "conv3_6_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_6_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_6_1x1_reduce"
  top: "conv3_6_1x1_reduce"
}
layer {
  name: "conv3_6_3x3"
  type: "Convolution"
  bottom: "conv3_6_1x1_reduce"
  top: "conv3_6_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_6_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_6_3x3"
  top: "conv3_6_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_6_3x3/scale"
  type: "Scale"
  bottom: "conv3_6_3x3"
  top: "conv3_6_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_6_3x3/relu"
  type: "ReLU"
  bottom: "conv3_6_3x3"
  top: "conv3_6_3x3"
}
layer {
  name: "conv3_6_1x1_increase"
  type: "Convolution"
  bottom: "conv3_6_3x3"
  top: "conv3_6_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_6_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_6_1x1_increase"
  top: "conv3_6_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_6_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_6_1x1_increase"
  top: "conv3_6_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_6"
  type: "Eltwise"
  bottom: "conv3_5"
  bottom: "conv3_6_1x1_increase"
  top: "conv3_6"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_6/relu"
  type: "ReLU"
  bottom: "conv3_6"
  top: "conv3_6"
}
layer {
  name: "conv3_7_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_6"
  top: "conv3_7_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_7_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_7_1x1_reduce"
  top: "conv3_7_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_7_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_7_1x1_reduce"
  top: "conv3_7_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_7_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_7_1x1_reduce"
  top: "conv3_7_1x1_reduce"
}
layer {
  name: "conv3_7_3x3"
  type: "Convolution"
  bottom: "conv3_7_1x1_reduce"
  top: "conv3_7_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_7_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_7_3x3"
  top: "conv3_7_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_7_3x3/scale"
  type: "Scale"
  bottom: "conv3_7_3x3"
  top: "conv3_7_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_7_3x3/relu"
  type: "ReLU"
  bottom: "conv3_7_3x3"
  top: "conv3_7_3x3"
}
layer {
  name: "conv3_7_1x1_increase"
  type: "Convolution"
  bottom: "conv3_7_3x3"
  top: "conv3_7_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_7_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_7_1x1_increase"
  top: "conv3_7_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_7_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_7_1x1_increase"
  top: "conv3_7_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_7"
  type: "Eltwise"
  bottom: "conv3_6"
  bottom: "conv3_7_1x1_increase"
  top: "conv3_7"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_7/relu"
  type: "ReLU"
  bottom: "conv3_7"
  top: "conv3_7"
}
layer {
  name: "conv3_8_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_7"
  top: "conv3_8_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_8_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_8_1x1_reduce"
  top: "conv3_8_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_8_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_8_1x1_reduce"
  top: "conv3_8_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_8_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_8_1x1_reduce"
  top: "conv3_8_1x1_reduce"
}
layer {
  name: "conv3_8_3x3"
  type: "Convolution"
  bottom: "conv3_8_1x1_reduce"
  top: "conv3_8_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_8_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_8_3x3"
  top: "conv3_8_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_8_3x3/scale"
  type: "Scale"
  bottom: "conv3_8_3x3"
  top: "conv3_8_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_8_3x3/relu"
  type: "ReLU"
  bottom: "conv3_8_3x3"
  top: "conv3_8_3x3"
}
layer {
  name: "conv3_8_1x1_increase"
  type: "Convolution"
  bottom: "conv3_8_3x3"
  top: "conv3_8_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_8_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_8_1x1_increase"
  top: "conv3_8_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_8_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_8_1x1_increase"
  top: "conv3_8_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_8"
  type: "Eltwise"
  bottom: "conv3_7"
  bottom: "conv3_8_1x1_increase"
  top: "conv3_8"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_8/relu"
  type: "ReLU"
  bottom: "conv3_8"
  top: "conv3_8"
}
layer {
  name: "conv3_9_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_8"
  top: "conv3_9_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_9_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_9_1x1_reduce"
  top: "conv3_9_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_9_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_9_1x1_reduce"
  top: "conv3_9_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_9_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_9_1x1_reduce"
  top: "conv3_9_1x1_reduce"
}
layer {
  name: "conv3_9_3x3"
  type: "Convolution"
  bottom: "conv3_9_1x1_reduce"
  top: "conv3_9_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_9_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_9_3x3"
  top: "conv3_9_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_9_3x3/scale"
  type: "Scale"
  bottom: "conv3_9_3x3"
  top: "conv3_9_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_9_3x3/relu"
  type: "ReLU"
  bottom: "conv3_9_3x3"
  top: "conv3_9_3x3"
}
layer {
  name: "conv3_9_1x1_increase"
  type: "Convolution"
  bottom: "conv3_9_3x3"
  top: "conv3_9_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_9_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_9_1x1_increase"
  top: "conv3_9_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_9_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_9_1x1_increase"
  top: "conv3_9_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_9"
  type: "Eltwise"
  bottom: "conv3_8"
  bottom: "conv3_9_1x1_increase"
  top: "conv3_9"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_9/relu"
  type: "ReLU"
  bottom: "conv3_9"
  top: "conv3_9"
}
layer {
  name: "conv3_10_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_9"
  top: "conv3_10_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_10_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_10_1x1_reduce"
  top: "conv3_10_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_10_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_10_1x1_reduce"
  top: "conv3_10_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_10_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_10_1x1_reduce"
  top: "conv3_10_1x1_reduce"
}
layer {
  name: "conv3_10_3x3"
  type: "Convolution"
  bottom: "conv3_10_1x1_reduce"
  top: "conv3_10_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_10_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_10_3x3"
  top: "conv3_10_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_10_3x3/scale"
  type: "Scale"
  bottom: "conv3_10_3x3"
  top: "conv3_10_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_10_3x3/relu"
  type: "ReLU"
  bottom: "conv3_10_3x3"
  top: "conv3_10_3x3"
}
layer {
  name: "conv3_10_1x1_increase"
  type: "Convolution"
  bottom: "conv3_10_3x3"
  top: "conv3_10_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_10_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_10_1x1_increase"
  top: "conv3_10_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_10_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_10_1x1_increase"
  top: "conv3_10_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_10"
  type: "Eltwise"
  bottom: "conv3_9"
  bottom: "conv3_10_1x1_increase"
  top: "conv3_10"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_10/relu"
  type: "ReLU"
  bottom: "conv3_10"
  top: "conv3_10"
}
layer {
  name: "conv3_11_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_10"
  top: "conv3_11_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_11_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_11_1x1_reduce"
  top: "conv3_11_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_11_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_11_1x1_reduce"
  top: "conv3_11_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_11_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_11_1x1_reduce"
  top: "conv3_11_1x1_reduce"
}
layer {
  name: "conv3_11_3x3"
  type: "Convolution"
  bottom: "conv3_11_1x1_reduce"
  top: "conv3_11_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_11_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_11_3x3"
  top: "conv3_11_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_11_3x3/scale"
  type: "Scale"
  bottom: "conv3_11_3x3"
  top: "conv3_11_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_11_3x3/relu"
  type: "ReLU"
  bottom: "conv3_11_3x3"
  top: "conv3_11_3x3"
}
layer {
  name: "conv3_11_1x1_increase"
  type: "Convolution"
  bottom: "conv3_11_3x3"
  top: "conv3_11_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_11_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_11_1x1_increase"
  top: "conv3_11_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_11_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_11_1x1_increase"
  top: "conv3_11_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_11"
  type: "Eltwise"
  bottom: "conv3_10"
  bottom: "conv3_11_1x1_increase"
  top: "conv3_11"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_11/relu"
  type: "ReLU"
  bottom: "conv3_11"
  top: "conv3_11"
}
layer {
  name: "conv3_12_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_11"
  top: "conv3_12_1x1_reduce"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_12_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv3_12_1x1_reduce"
  top: "conv3_12_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_12_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv3_12_1x1_reduce"
  top: "conv3_12_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_12_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv3_12_1x1_reduce"
  top: "conv3_12_1x1_reduce"
}
layer {
  name: "conv3_12_3x3"
  type: "Convolution"
  bottom: "conv3_12_1x1_reduce"
  top: "conv3_12_3x3"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv3_12_3x3/bn"
  type: "BatchNorm"
  bottom: "conv3_12_3x3"
  top: "conv3_12_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_12_3x3/scale"
  type: "Scale"
  bottom: "conv3_12_3x3"
  top: "conv3_12_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_12_3x3/relu"
  type: "ReLU"
  bottom: "conv3_12_3x3"
  top: "conv3_12_3x3"
}
layer {
  name: "conv3_12_1x1_increase"
  type: "Convolution"
  bottom: "conv3_12_3x3"
  top: "conv3_12_1x1_increase"
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv3_12_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv3_12_1x1_increase"
  top: "conv3_12_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv3_12_1x1_increase/scale"
  type: "Scale"
  bottom: "conv3_12_1x1_increase"
  top: "conv3_12_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_12"
  type: "Eltwise"
  bottom: "conv3_11"
  bottom: "conv3_12_1x1_increase"
  top: "conv3_12"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv3_12/relu"
  type: "ReLU"
  bottom: "conv3_12"
  top: "conv3_12"
}
layer {
  name: "conv4_1_1x1_reduce"
  type: "Convolution"
  bottom: "conv3_12"
  top: "conv4_1_1x1_reduce"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv4_1_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_1_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_1_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_1x1_reduce"
}
layer {
  name: "conv4_1_3x3"
  type: "Convolution"
  bottom: "conv4_1_1x1_reduce"
  top: "conv4_1_3x3"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_1_3x3/bn"
  type: "BatchNorm"
  bottom: "conv4_1_3x3"
  top: "conv4_1_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_1_3x3/scale"
  type: "Scale"
  bottom: "conv4_1_3x3"
  top: "conv4_1_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_1_3x3/relu"
  type: "ReLU"
  bottom: "conv4_1_3x3"
  top: "conv4_1_3x3"
}
layer {
  name: "conv4_1_1x1_increase"
  type: "Convolution"
  bottom: "conv4_1_3x3"
  top: "conv4_1_1x1_increase"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv4_1_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv4_1_1x1_increase"
  top: "conv4_1_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_1_1x1_increase/scale"
  type: "Scale"
  bottom: "conv4_1_1x1_increase"
  top: "conv4_1_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_1_1x1_proj"
  type: "Convolution"
  bottom: "conv3_12"
  top: "conv4_1_1x1_proj"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
  }
}
layer {
  name: "conv4_1_1x1_proj/bn"
  type: "BatchNorm"
  bottom: "conv4_1_1x1_proj"
  top: "conv4_1_1x1_proj"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_1_1x1_proj/scale"
  type: "Scale"
  bottom: "conv4_1_1x1_proj"
  top: "conv4_1_1x1_proj"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_1"
  type: "Eltwise"
  bottom: "conv4_1_1x1_proj"
  bottom: "conv4_1_1x1_increase"
  top: "conv4_1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "conv4_1/relu"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2_1x1_reduce"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2_1x1_reduce"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv4_2_1x1_reduce/bn"
  type: "BatchNorm"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_1x1_reduce"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_2_1x1_reduce/scale"
  type: "Scale"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_1x1_reduce"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_2_1x1_reduce/relu"
  type: "ReLU"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_1x1_reduce"
}
layer {
  name: "conv4_2_3x3"
  type: "Convolution"
  bottom: "conv4_2_1x1_reduce"
  top: "conv4_2_3x3"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "conv4_2_3x3/bn"
  type: "BatchNorm"
  bottom: "conv4_2_3x3"
  top: "conv4_2_3x3"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_2_3x3/scale"
  type: "Scale"
  bottom: "conv4_2_3x3"
  top: "conv4_2_3x3"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_2_3x3/relu"
  type: "ReLU"
  bottom: "conv4_2_3x3"
  top: "conv4_2_3x3"
}
layer {
  name: "conv4_2_1x1_increase"
  type: "Convolution"
  bottom: "conv4_2_3x3"
  top: "conv4_2_1x1_increase"
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "conv4_2_1x1_increase/bn"
  type: "BatchNorm"
  bottom: "conv4_2_1x1_increase"
  top: "conv4_2_1x1_increase"
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "conv4_2_1x1_increase/scale"
  type: "Scale"
  bottom: "conv4_2_1x1_increase"
  top: "conv4_2_1x1_increase"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_2"
  type: "Eltwise"
  bottom: "conv4_1"
  bottom: "conv4_2_1x1_increase"
  top: "conv4_2"
  eltwise_param {
